programs/B-preProcessing/system/controlDict.probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     gravityPisoFoam;

startFrom       latestTime;

startTime       800;

stopAt          endTime;

endTime         900;

deltaT          0.00001;

writeControl    adjustableRunTime;

writeInterval   20;

purgeWrite      5;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           1.0;
maxAlphaCo      1.0;
maxDeltaT       0.03;


functions
{
/*
Volume
    {
        type            volFieldValue;
        libs ("libfieldFunctionObjects.so");
        writeControl   timeStep;
        log             true;
        // Output field values as well
        writeFields     false;
        regionType      all;
        name            OutletNorefineSortie;
        operation       sum;

        fields
        (
            s U
        );
    }
*/
	#include "probes"
}
// ************************************************************************* //
