programs/B-preProcessing/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters		1;															
																	
vertices																	
(																	
( 0   0   0 )  // 0
( 0   0   0 )  // 1
( 0   0   0 )  // 2
( 0   0   0 )  // 3
( 0   0   0 )  // 4
( 0   0   0 )  // 5
( 0   0   0 )  // 6
( 0   0   0 )  // 7
);																	
																	
blocks																	
(																	
hex (0 1 2 3 4 5 6 7) (88 88 15) simpleGrading (1 1 1)
);																	
																	
edges																	
(																	
);																	
																	
boundary																	
(
	inletAir
	{
	type patch;
	faces
	(
		(2 6 7 3)
	);
	}
	outletPolAir
	{
	type patch;
	faces
	(
		(0 4 5 1)
	);
	}
	symmetryRight
	{
	type symmetry;
	faces
	(
		(1 5 6 2)
	);
	}
	symmetryLeft
	{
	type symmetry;
	faces
	(
		(0 3 7 4)
	);
	}
	symmetryRoof
	{
	type symmetry;
	faces
	(
		(4 7 6 5)
	);
	}																	
);																	
																
																
														
																
											
															

// ************************************************************************* //
