programs/B-preProcessing/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{

     inletAir
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditionsInlet"
    }
     symmetryRight
    {
        type            symmetry;
    }
     symmetryLeft
    {
        type            symmetry;
    }
    "wallGround.*"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
        value           uniform (0 0 0);
    }
     wallBlock
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
     symmetryRoof
    {
        type            symmetry;
    }
     outletPolAir
    {
        type            freestream;
	freestreamValue	uniform $flowVelocity;
    }
}


// ************************************************************************* //
