programs/B-preProcessing/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $turbulentEpsilon;

boundaryField
{

    inletAir
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditionsInlet"
    }
    symmetryRight
    {
        type            symmetry;
    }
    symmetryLeft
    {
        type            symmetry;
    }
    "wallGround.*"
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        E               9.8;
        value           $internalField;
    }
    wallBlock
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    symmetryRoof
    {
        type            symmetry;
    }
    ".*"
    {
        type            inletOutlet;
        inletValue      uniform $turbulentEpsilon;
        value           $internalField;
    }
}


// ************************************************************************* //
