programs/B-preProcessing/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
 
    inletAir
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditionsInlet"
    }
     symmetryRight
    {
        type            symmetry;
    }
     symmetryLeft
    {
        type            symmetry;
    }
    "wallGround.*"
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }
     wallBlock
    {
        type            kqRWallFunction;
        value           $internalField;
    }
     symmetryRoof
    {
        type            symmetry;
    }

    ".*"
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }
}

// ************************************************************************* //
