programs/B-preProcessing/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditionsDomain"

     symmetryRight
    {
        type            symmetry;
    }
     symmetryLeft
    {
        type            symmetry;
    }
    "wallGround.*"
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0Ground;
        value           uniform 0.0;
    }
     wallBlock
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
     symmetryRoof
    {
        type            symmetry;
    }
    ".*"
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
