programs/B-preProcessing/0/s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletAir
    {
        type            fixedValue;
        value           uniform 0;
    }
    symmetryRight
    {
        type            symmetry;
    }
    symmetryLeft
    {
        type            symmetry;
    }
    "wallGround.*"
    {
        type            zeroGradient;
    }
    wallBlock
    {
        type            zeroGradient;
    }
    symmetryRoof
    {
        type            symmetry;
    }
    outletPolAir
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
